import React from "react";
import {
  Container,
  ContainerBox,
  Title,
  ContainerContent,
  ContentTitle,
  ContentImageBox,
  ContentImage,
  ContentText,
  ContainerContentBox,
  ContentCardBox,
  ContentCard,
  Card,
  CardImage,
} from "./publicationMoreStyle";
import Headers from "../../components/Headers";
import "boxicons";
import img from "../../assets/images/bg-13.jpg";
import img1 from "../../assets/images/bg-17.jpg";
import img2 from "../../assets/images/down1.jpg";
import Footer from "../../components/Footer/footer";
import ScrollTop from "../../components/ScrollTop/scrollTop";

function PublicationMore() {
  return (
    <Container>
      <Headers />
      <ContainerBox
        style={{
          backgroundImage: `url(${img})`,
          backgroundBlendMode: "darken",
        }}
      >
        <Title>
          <box-icon name="home" color="#fff"></box-icon>/Как выбрать мебель для
          прихожей
        </Title>
      </ContainerBox>
      <ContainerContentBox style={{ backgroundImage: `url(${img2})` }}>
        <ContainerContent>
          <ContentTitle>Как выбрать мебель для прихожей</ContentTitle>
          <ContentText>
            Треть своей жизни человек проводит в спальне. Здоровый крепкий сон
            определяет качество жизни человека. По этой причине, немаловажно
            выбрать правильную кровать Треть своей жизни человек проводит в
            спальне. Здоровый крепкий сон определяет качество жизни человека. По
            этой причине, немаловажно выбрать правильную кровать
          </ContentText>
          <ContentImageBox>
            <ContentImage src={img1} />
          </ContentImageBox>
          <ContentTitle>Как выбрать</ContentTitle>
          <ContentText>
            Треть своей жизни человек проводит в спальне. Здоровый крепкий сон
            определяет качество жизни человека. По этой причине, немаловажно
            выбрать правильную кровать Треть своей жизни человек проводит в
            спальне. Здоровый крепкий сон определяет качество жизни человека. По
            этой причине, немаловажно выбрать правильную кровать
          </ContentText>
          <ContentCard>
            <Card>
              <CardImage src={img1} />
            </Card>
            <Card>
              <CardImage src={img1} />
            </Card>
            <Card>
              <CardImage src={img1} />
            </Card>
            <Card>
              <CardImage src={img1} />
            </Card>
          </ContentCard>
        </ContainerContent>
      </ContainerContentBox>
      <ContainerContentBox style={{ backgroundImage: `url(${img2})` }}>
        <ContainerContent>
          <ContentTitle>Как выбрать мебель </ContentTitle>
          <ContentText>
            Треть своей жизни человек проводит в спальне. Здоровый крепкий сон
            определяет качество жизни человека. По этой причине, немаловажно
            выбрать правильную кровать Треть своей жизни человек проводит в
            спальне. Здоровый крепкий сон определяет качество жизни человека. По
            этой причине, немаловажно выбрать правильную кровать Треть своей
            жизни человек проводит в спальне. Здоровый крепкий сон определяет
            качество жизни человека. По этой причине, немаловажно выбрать
            правильную кровать Треть своей жизни человек проводит в спальне.
            Здоровый крепкий сон определяет качество жизни человека. По этой
            причине, немаловажно выбрать правильную кровать Треть своей жизни
            человек проводит в спальне. Здоровый крепкий сон определяет качество
            жизни человека. По этой причине, немаловажно выбрать правильную
            кровать
          </ContentText>
          <ContentImageBox>
            <ContentImage src={img1} />
          </ContentImageBox>
          <ContentText>
            Треть своей жизни человек проводит в спальне. Здоровый крепкий сон
            определяет качество жизни человека. По этой причине, немаловажно
            выбрать правильную кровать Треть своей жизни человек проводит в
            спальне. Здоровый крепкий сон определяет качество жизни человека. По
            этой причине, немаловажно выбрать правильную кровать Треть своей
            жизни человек проводит в спальне. Здоровый крепкий сон определяет
            качество жизни человека. По этой причине, немаловажно выбрать
            правильную кровать Треть своей жизни человек проводит в спальне.
            Здоровый крепкий сон определяет качество жизни человека. По этой
            причине, немаловажно выбрать правильную кроватьТреть своей жизни
            человек проводит в спальне. Здоровый крепкий сон определяет качество
            жизни человека. По этой причине, немаловажно выбрать правильную
            кроватьТреть своей жизни человек проводит в спальне. Здоровый
            крепкий сон определяет качество жизни человека. По этой причине,
            немаловажно выбрать правильную кровать
          </ContentText>
          <ContentTitle>Как выбрать мебель для прихожей</ContentTitle>
          <ContentCard>
            <Card>
              <CardImage src={img1} />
            </Card>
            <Card>
              <CardImage src={img1} />
            </Card>
            <Card>
              <CardImage src={img1} />
            </Card>
            <Card>
              <CardImage src={img1} />
            </Card>
          </ContentCard>
          <ContentText>
            Треть своей жизни человек проводит в спальне. Здоровый крепкий сон
            определяет качество жизни человека. По этой причине, немаловажно
            выбрать правильную кровать Треть своей жизни человек проводит в
            спальне. Здоровый крепкий сон определяет качество жизни человека. По
            этой причине, немаловажно выбрать правильную кровать Треть своей
            жизни человек проводит в спальне. Здоровый крепкий сон определяет
            качество жизни человека. По этой причине, немаловажно выбрать
            правильную кровать Треть своей жизни человек проводит в спальне.
            Здоровый крепкий сон определяет качество жизни человека. По этой
            причине, немаловажно выбрать правильную кроватьТреть своей жизни
            человек проводит в спальне. Здоровый крепкий сон определяет качество
            жизни человека. По этой причине, немаловажно выбрать правильную
            кроватьТреть своей жизни человек проводит в спальне. Здоровый
            крепкий сон определяет качество жизни человека. По этой причине,
            немаловажно выбрать правильную кровать
          </ContentText>
        </ContainerContent>
      </ContainerContentBox>
      <ScrollTop />
      <Footer />
    </Container>
  );
}

export default PublicationMore;
